In [100]:
# pre-processing
import pandas as pd
import numpy as np
df = pd.read_csv("C:/Users/Brandon/Documents/GitHub/bt3103-1d4-statistical-learning/src/data/titanic.csv")

In [82]:
# import plt
import matplotlib.pyplot as plt

In [117]:
df.head(10)

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S
5,6,0,3,"Moran, Mr. James",male,NaN,0,0,330877,8.4583,NaN,Q
6,7,0,1,"McCarthy, Mr. Timothy J",male,54.0,0,0,17463,51.8625,E46,S
7,8,0,3,"Palsson, Master. Gosta Leonard",male,2.0,3,1,349909,21.0750,NaN,S
8,9,1,3,"Johnson, Mrs. Oscar W (Elisabeth Vilhelmina Berg)",female,27.0,0,2,347742,11.1333,NaN,S
9,10,1,2,"Nasser, Mrs. Nicholas (Adele Achem)",female,14.0,1,0,237736,30.0708,NaN,C

In [113]:
df_sex = pd.get_dummies(df["Sex"])
df_sex.head(5)

   female  male
0       0     1
1       1     0
2       1     0
3       1     0
4       0     1

In [119]:
df["Sex"] = df_sex["female"]
df.head(5)

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",0,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",1,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",1,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",1,35.0,1,0,113803,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",0,35.0,0,0,373450,8.0500,NaN,S

In [161]:
df = pd.read_csv("C:/Users/Brandon/Documents/GitHub/bt3103-1d4-statistical-learning/src/data/titanic.csv")
df_embarked = pd.get_dummies(data = df["Embarked"], dummy_na = True)
df_embarked.head() # Peek at the top 5 rows

   C  Q  S  NaN
0  0  0  1    0
1  1  0  0    0
2  0  0  1    0
3  0  0  1    0
4  0  0  1    0

In [162]:
df_embarked = df_embarked.drop(np.nan,axis = 1)
df = pd.concat([df,df_embarked], axis = 1)
df.head(5)

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked,C,Q,S
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S,0,0,1
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C,1,0,0
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S,0,0,1
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S,0,0,1
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S,0,0,1

In [164]:
len(df["Ticket"].unique())

681

In [ ]:
plt.figure(figsize=(15,8))
plt.scatter(df['Fare'], df['Survived'],s = 15)
plt.title('Plot of Survived against Fare')
plt.xlabel('Fare')
plt.ylabel('Survived')
plt.show()

In [ ]:
plt.figure(figsize=(15,8))
plt.scatter(df['Fare'], df['Survived'],s = 15)
plt.title('Plot of Survived against Fare')
plt.xlabel('Fare')
plt.ylabel('Survived')
plt.plot(np.unique(df['Fare']), np.poly1d(np.polyfit(df['Fare'], df['Survived'], 1))(np.unique(df['Fare'])), color = 'r')
plt.show()

In [ ]:
import seaborn as sns
sns.regplot(x='Fare', y='Survived', data=df, logistic=True)

In [ ]:
# import the required packages
import statsmodels.formula.api as smf
import statsmodels
probit = smf.probit(formula='Survived ~ Fare + Pclass + Age', data=df)
result = probit.fit()